[
    {
        "title": "Welcome!",
        "page": "home",
        "date": "2020-09-24",
        "content": ["I'm Liam Fruzyna, an Embedded Software Engineer in <a href=\"https://www.motorolasolutions.com/en_us/solutions/national-government-security.html\">Motorola Solutions'</a> Applied Technology department.",
            "Before coming to Motorola I graduated from <a href=\"https://www.marquette.edu/about/\">Marquette University</a> in May 2019, double majoring in <a href=\"https://www.marquette.edu/computer-science/\">Computer Science and Data Science</a>.",
            "There I worked as a Technology Support Assistant, Undergraduate Researcher, and Lead Developer making <a href=\"https://github.com/mail929/MU-Archive/tree/master/COE-Tech\">Python scripts</a> and <a href=\"https://github.com/MUnchMates/MUnchMates-Android\">Android apps</a>, plus <a href=\"https://github.com/mail929/MU-Archive\">my everday course work</a>.",
            "Nowadays at Motorola, I'm working primarily in Python with some C++ and JavaScript on the side.",
            "In my free time I mentor my high school robotics team, <a href=\"https://www.thebluealliance.com/team/111\">FRC Team 111</a>, where I guide software students in <a href=\"https://github.com/wildstang\">programming robots with Java</a> and am rebooting my high school project <a href=\"https://github.com/mail929/LiamRank\">WildRank</a>."
        ]
    },
    {
        "title": "Contact",
        "page": "home",
        "date": "2020-10-01",
        "content": ["Should you want to contact me for some reason my prefered method is Telegram, you can find me @fruzyna.",
            "Alternatively, my email is my full name at gmail."
        ]
    },
    {
        "title": "Projects",
        "page": "projects",
        "date": "2020-09-25",
        "link": "https://github.com/mail929",
        "content": ["These are just a couple placeholder projects as I complete my website.",
            "Please view my GitHub profile if you'd like to see more of my work.",
            "Unfortunately due to the nature of the work, I cannot share what I work on at Motorola.",
            "But I can confirm that I do not make phones, and nobody at the company works on the \"RAZR\"."
        ]
    },
    {
        "title": "LiamRank",
        "page": "projects",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/LiamRank",
        "content": ["LiamRank is a spiritual successor to the FRC scouting app I helped develop in high school, WildRank.",
            "This time the app is developed for the web with simple client apps written for offline use on various platforms."
        ]
    },
    {
        "title": "Finance v2",
        "page": "projects",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/Finance-v2",
        "content": ["Once apon a time I made a command line finances application with Pandas and a CSV file.",
            "Then I added a web interface on top of it, it became very messy.",
            "Now I have Finance v2 which is an Express.js web app with a MariaDB server and user accounts."
        ]
    },
    {
        "title": "Personal Site",
        "page": "projects",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/personal-site",
        "content": ["This website is a self-hosted project of mine.",
            "Its some pretty basic CSS and HTML plus a few lines of JavaScript."
        ]
    },
    {
        "title": "School Work",
        "page": "projects",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/MU-Archive",
        "content": ["I worked on all kinds of projects in college.",
            "This includes Java, Python, C, JavaScript, SQL, and more.",
            "View my archive to see a large portion of my class and job work from college."
        ]
    },
    {
        "title": "Homepage",
        "page": "projects",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/homepage",
        "content": ["Simple webpage that displays the time, a list of folders containing links and 2 groups of RSS feeds."]
    },
    {
        "title": "OTD Calcs Web",
        "page": "projects",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/otd-calcs-web",
        "content": ["Simple static webpage that calculates the OTD (out the door) price for a car sale."]
    },
    {
        "title": "Blog",
        "page": "blog",
        "date": "2020-09-24",
        "content": ["This website will also serve as a portal for occasional blog posts.",
            "Because I'm subborn it is really poorly implemented, but it's just a place for me to dump thoughts. Posts can be found below."
        ]
    },
    {
        "title": "Nintendo Switch Lite Review",
        "page": "blog",
        "date": "2020-10-24",
        "content": ["<h2>Why I bought it</h2>",
            "I was hesitant to buy a Switch Lite.",
            "I have wanted a Switch since it came out.",
            "Nintendo IP is great, but there hadn't been any particular IPs pulling me toward the Switch.",
            "This changed when Animal Crossing New Horizons came out.",
            "I have played every Animal Crossing game and have owned the last three.",
            "Plus, I have a real job now and had no excuse to avoid paying for a Switch.",
            "I had convinced myself to pay the extra $100 for a normal Switch but those are impossible to find right now so I ended up with a Yellow Switch Lite along with Animal Crossing New Horizons of course.",
            "<img src=\"assets/switch/switch.jpg\">",
            "<h2>Build Quality</h2>",
            "This is my favorite Nintendo handheld ever.",
            "I have owned a Gameboy Advance, Gameboy Advance SP, DS Lite, DSi, and 3DS and nothing comes close to the Switch Lite.",
            "I have held a few normal Switches as well and the Lite is an improvement over it too.",
            "In my hands it feels a lot like a grown-up Gameboy Advance which is likely because it's my first Nintendo handheld that doesn't fold since the GBA.",
            "The matte plastic is very comfortable in the hand and despite not having much in the way of ergonomic features it sits very comfortable in the hands with the slight lip behind the shoulder buttons and the round corners on the bottom.",
            "There are no Joycons that slide off but that allows it to be so much more compact and polished feeling.",
            "The touch screen feels fine without feeling fragile and all the buttons click great.",
            "The joysticks are a bit shallow and their limits feel almost hexagonal but they are better than those on the 3DS.",
            "There are flaps over the MicroSD card and game card slots which look nice but feel like they are barely holding on with their clips.",
            "There are stereo speakers and a USB C port on the bottom, grills on the back, and a headphone jack and vent on top.",
            "The two grills on the back give a symmetric appearance, but it is a shame that only about half of one is functional.",
            "A final minor note is there is a slight cutout in the bottom of the device to place its serial number and barcode, it makes it feel slightly best polished but is barely noticable.",
            "<h2>It doesn't switch!</h2>",
            "The big difference in the Lite is the fact that it doesn't \"switch\" at all.",
            "And for me this isn't a problem whatsoever.",
            "The only game I have bought is Animal Crossing and that game absolutely does not need to be on the big screen.",
            "Now, the Switch has incredible couch co-op support and I think it is the perfect party console for games like Overcooked, Jackbox, and Speedrunners.",
            "I love these kinds of games, but I already own them on my much more powerful PC.",
            "Plus, as a college graduate I don't have many people around to play these games anyways.",
            "<h2>USB C</h2>",
            "USB C is great and on the Switch Lite it does provide more than power, unlike some devices, but it isn't very great.",
            "Of course it does not support video out, but I also was unable to get my USB C headphones to work and connecting it to my phone only allowed me to charge my phone.",
            "I was able to get an ethernet connection to work and my understanding is that keyboards work too. But the limited functionality is disappointing.",
            "<h2>Battery Life</h2>",
            "The battery life kinda sucks. I got probably about 5 hours on Animal Crossing which is fine but it felt like I was charging it all the time.",
            "Standby power also was not a strong point.",
            "This was one of my hesitations about the Lite over the Switch but it's not that big of a deal.",
            "<h2>Operating System</h2>",
            "This hardware has a ton of potential and I think the OS is really limiting it.",
            "I thought it was so cool that the original Switch could be hacked to run Linux or Android and my dream was to use a Switch as a portable Steam Link.",
            "Unfortunately, this is not possible without a hardware modification on the Lite.",
            "The eShop allows you to buy about any Switch title digitally but its pretty slow and the non-cartridge software is limited.",
            "The interface is pretty well done but can feel a bit fragmented.",
            "But the stunner is a lack of a web browser.",
            "Every Nintendo device since the DS has had a web browser in some capacity and while it is true that there is one on the Switch it is really only designed for WiFi network login.",
            "There is also no real multitasking much like on the 3DS.",
            "All of this combined makes the Switch feel more like a Gameboy than an Android tablet, which the hardware is built out a lot more like.",
            "One plus is the built in screenshot button, it makes it super easy to grab a click of what just happened on the screen and does support some limited sharing functionality.",
            "<h2>Nintendo Online</h2>",
            "As usual Nintendo's online services are rough and this time they are even charging for them.",
            "Fortunately the price is reasonable and it comes with virtual NES and SNES consoles.",
            "<h2>Screen</h2>",
            "The screen is fine. It is 720p which is disappointingly low, but still looks fine if you don't hold it too close and allows the Switch to run pretty comfortably.",
            "I think the size if perfect, any bigger and it would feel clunky like the original Switch, and any smaller and it would feel like a toy.",
            "The screen didn't feel particularly fast and the blacks aren't that dark, but the colors seemed vibrant.",
            "<h2>Months Later</h2>",
            "I wrote this review at least 4 months ago and never finished it.",
            "Coming from a perspective of months of use, the console has held up really well.",
            "Beyond a slight polishing where it sits, there is no noticeable wear on the body and buttons are still as clicky as ever.",
            "I do have to say that the shoulder buttons are disappointing, they are not nearly as tactile as the other buttons.",
            "While I have yet to experience joystick drift the joysticks have been smoothed down a bit, but the wear is not very noticable.",
            "Animal Crossing is still the only game I have purchased for it, but I do plan on buying Super Mario 3D All-Stars soon."
        ]
    },
    {
        "title": "Do Cows or Coal Contribute More to Wisconsin's Greenhouse Gas Emissions?",
        "page": "blog",
        "date": "2020-10-14",
        "content": ["I was talking to a friend about Wisconsin, their insistence on coal-fired power plants, and how great dairy is when I wondered which produces more CO2, Wisconsin's cows or power plants?",
            "So I decided to do the math. Now, I must note that these numbers may not be perfect, only some brief research was included.",
            "Never-the-less, here is the math.<br><br><code>",
            "Numbers of Cows<br>",
            "1.26 m dairy cows<br>",
            "0.31 m beef cows<br><br>",
            "Carbon Impact of Cows by Protein<br>",
            "9 g CO2-Ceq per g protein dairy<br>",
            "62 g CO2-Ceq per g protein beef<br><br>",
            "Output of a Cow<br>",
            "2300 gal milk per cow per year<br>",
            "430 pounds beef per cow<br><br>",
            "Protein of Cow Outputs<br>",
            "128 g protein per gallon milk<br>",
            "~100 g protein per pound beef<br><br>",
            "Protein in Output of One Cow<br>",
            "294400 g protein of milk per cow per year<br>",
            "43000 g protein of beef per cow per year<br><br>",
            "Carbon Impact of Cow<br>",
            "2.649 m g CO2-Ceq per dairy cow per year<br>",
            "2.666 m g CO2-Ceq per beef cow<br><br>",
            "Carbon Impact of Wisconsin Cows<br>",
            "3.338 t g CO2-Ceq by dairy cows in Wisconsin per year<br>",
            "0.826 t g CO2-Ceq by beef cows in Wisconsin<br>",
            "4.165 t g CO2-Ceq by cows in Wisconsin<br>",
            "<b>9.182 b lbs CO2 generated by cows in Wisconsin</b><br><br>",
            "Wisconsin Coal Production<br>",
            "2.241 m MWh electricity generated by coal in Wisconsin<br>",
            "2.241 b kWh electricity generated by coal in Wisconsin<br><br>",
            "Carbon Impact of Coal<br>",
            "2.21 lbs CO2 per kWh coal electricity<br>",
            "<b>4.953 b lbs CO2 generated by coal in Wisconsin</b><br><br>",
            "<b>1.854x more CO2 generated by cows than coal in Wisconsin</b></code><br><br>",
            "First, it was reaffirming that the carbon impact of a cow ended up being nearly the same whether the cow was used for dairy or beef production.",
            "I was impressed that the two ended up on the same order of magnitude and even more impressed that I was right.<br><br>",
            "Sources:<ul>",
            "<li><a href=\"https://en.wikipedia.org/wiki/Environmental_impact_of_meat_production#Greenhouse_gas_emissions\">Cow Emissions</a></li>",
            "<li><a href=\"https://www.nass.usda.gov/Statistics_by_State/Wisconsin/Publications/Livestock/2020/WI-Cattle-01-20.pdf\">Cows in Wisconsin</a></li>",
            "<li><a href=\"https://www.eia.gov/state/?sid=WI#tabs-4\">Wisconsin Coal-Fired Electricity Generation</a></li>",
            "<li><a href=\"https://www.eia.gov/tools/faqs/faq.php?id=74&t=11\">Coal Emissions</a></li>"
        ]
    },
    {
        "title": "Building an Actually Good Ikea Desk",
        "page": "blog",
        "date": "2020-10-10",
        "content": ["If you browse r/battlestations you'll see tons of examples of Ikea desks, consisting of some kind of Ikea countertop and an Alex drawer or two.",
            "I wanted a large desk and nothing I could find sufficed so once all the parts were back in stock I went to Ikea and bought what I would need.<ul>",
            "<li><a href=\"https://www.ikea.com/us/en/p/saeljan-countertop-oak-effect-laminate-80439214/\">2 SÄLJAN Oak Effect Laminate Countertops</a></li>",
            "<li><a href=\"https://www.ikea.com/us/en/p/alex-drawer-unit-blue-40410340/\">2 ALEX Blue Drawer Units</a></li>",
            "<li><a href=\"https://www.ikea.com/us/en/p/adils-leg-black-70217973/\">6 ADILS Black Legs</a></li></ul>",
            "I assembled the desks in an L configuration with Alex drawers on each end and 2 legs opposite of the drawers and 1 more in the middle of each desk.",
            "I was hesitant about the laminate countertops but the finish is very convincing and they are very solid. They are definitely worth the steep discount.",
            "The drawers are fine, the paint gets scuffed very easily and the rubber feet provided to let the counter sit on aren't the best solution.",
            "Otherwise, they are very stylish and perfectly functional.",
            "I was nervous about the height of the desk but it turned out perfect.",
            "The legs were more supportive than I expected and the adjustable feet are a nice touch.",
            "But even with the feet I found it hard to keep the whole desk as stable as I would have liked.",
            "The desks would get a little crooked with the drawers and each other in the L.",
            "Also one of the desks appeared to be a little warped, only sitting on one side of the drawers.",
            "To improve this I went to Home Depot and bought a few more parts.<ul>",
            "<li><a href=\"https://www.homedepot.com/p/Everbilt-6-in-Galvanized-Mending-Plate-2-Pack-15266/202034268\">2 6\" Mending Plates</a></li>",
            "<li><a href=\"https://www.homedepot.com/p/Everbilt-2-in-Steel-Black-Corner-Brace-4-Pack-13751/300985586\">4 2\" Corner Braces</a></li>",
            "<li><a href=\"https://www.homedepot.com/p/Everbilt-2-in-Galvanized-Mending-Plates-2-Pack-14579/203339964\">2 2\" Mending Plates</a></li></ul>",
            "<img src=\"assets/ikea-desk/desk-connection.jpg\">",
            "To improve the stability between the desks I got 2 large mending plates and screwed them below the desks.",
            "This accomplished most of the goals, making it much harder to move the desks by combining their masses.",
            "<img src=\"assets/ikea-desk/drawer-connection.jpg\">",
            "To prevent the desks from coming unaligned with the drawers I used the corner braces to mount the drawers to the undersides of the desks.",
            "Just 2 braces were enough to hold everything in place. Additionally, small mending plates could be used to add even more security, but I found them unnecessary for that purpose.",
            "<img src=\"assets/ikea-desk/warp-fix.jpg\">",
            "Finally, I used the smaller straps to straighten out my warped countertop, screwing them to the outside of the drawers and countertop, with someone pushing down on the countertop while I drilled the screws in.",
            "This completely removed the warp from the countertop. There was a slight warp on the other desk but I determined it wasn't necessary.<br><br>",
            "This desk worked out even better than expected. Unlike what I had read online, the weight of the countertops did not provide the stability I desired.",
            "But once I made the improvements, the desk was incredibly stable and I would highly recommend this method to anyone doing the same.",
            "<img src=\"assets/ikea-desk/whole-desk.jpg\">"
        ]
    },
    {
        "title": "Reloading Imports in Python",
        "page": "blog",
        "date": "2020-10-09",
        "content": ["I've been having a problem at work lately, and elsewhere for a while.",
            "When running Jupyter notebooks with large amounts of data, sometimes I am debugging both the notebook and a local import it is using.",
            "The problem that arrises is when a local import changes, simply re-running the import statement is not effective, the kernel must be restarted.",
            "The main problem with this is many of these notebooks take hours to catch back up to where the bug was found, so restarting the kernel is not ideal.",
            "Fortunately, I finally Googled my issue and found a simple solution.",
            "<br><br><code>from importlib import reload<br>reload(import_object)</code><br><br>",
            "Once the reload function is called, the latest version of the import should be loaded in."
        ]
    },
    {
        "title": "Garmin Forerunner 35 Review",
        "page": "blog",
        "date": "2019-09-20",
        "content": ["<h2>Summary</h2>",
            "I really like this watch. If you are looking for a watch primarily for running, but would like some modern smartwatch features without spending too much money I would highly recommend the Garmin Forerunner 35. It has excellent battery life and GPS tracking, plus a smattering of other useful features.",
            "<h2>Introduction</h2>",
            "<h3>Why I bought this watch</h3>",
            "I have had a series of smartwatches at this point. The Garmin Forerunner 35 is my fourth following the Motorola MotoACTV, Samsung Gear Live, and (briefly) Fossil Sport Smartwatch in chronological order. All of these watches besides the Gear Live feature GPS connectivity, which has been a primary feature for me when buying watches because I am a runner. Due to this, solid GPS connectivity was very important and actually the reason I returned the Fossil Sport after using it for about a week. In my periods between watches I generally tracked my runs with Strava on my phone, which has a very quick and accurate GPS. The Sport took far too long to connect and had quite wavy accuracy. The Garmin connect app allows runs to be automatically uploaded to Strava and my brother had a good experience with his Forerunner 25 so I trusted the 35's accuracy.<br><br>",
            "The next most important feature was battery life. I required a minimum of an all day battery with an always on display. All my previous watches were able to obtain this, but not by very much. The 35 has a transflective memory-in-pixel (MIP) display which means it does not require a backlight to view in a lit setting. This saves a lot of power and allows a many day battery life.<br><br>",
            "Everything else beyond this was a bonus. The 35 features phone notification support and music controls which I enjoyed having on my two Android Wear watches. Heart rate tracking was something I was interested in and it offered. Plus, it comes in a relatively small package and could be had refurbished for less than $100.",
            "<h4>Alternatives</h4>",
            "I had settled on Garmin because of recommendations from friends and families. I also considered the Forerunner 25, 45, and 245, as well as, the Vivoactive 3. In the end I decided that I was better to go with a cheaper option because I wasn't that interested in the extended smartwatch functionality and worried about the battery life of a color display. I also avoided the Vivoactive 3 due to rumors of the 4 coming out in September, which it did. The 25 new was only about $10 less than the 35 refurbished so I decided to splurge there.",
            "<h3>Purchasing</h3>",
            "I ended up purchasing the Garmin Forerunner 35 on Amazon.com, refurbished or as Amazon calls it \"renewed\". I purchased the black model on August 22nd, 2019 for $99.99.",
            "<h3>Out of Box</h3>",
            "The watch arrived in a pretty standard sized watch box that denoted it was a refurbished product and included only the watch, USB charging cable (note, no power brick), and expected documentation.",
            "<h3>Usage</h3>",
            "I've used this watch for 29 days and counting now, wearing it all day and night, except when I shower or it is charging. For the most part I use the GPS for running 5 days a week for 30-45 minutes a day.",
            "<h2>The Review</h2>",
            "<h3>Hardware</h3>",
            "<h4>Construction</h4>",
            "The Forerunner 35 is constructed almost entirely of plastic with a silicone strap. The website describes the screen as being covered in \"chemically strengthened glass\" and while it doesn't seem particularly plastic-like, it feels much simpler than what you would find on a modern smartphone. It should be noted that I have yet to cause any noticeable damage to the screen. The body's construction is fine. It definitely isn't the strongest but I have only managed a few small scuffs around the edge of the display. This does result in a very light body, making it very comfortable to wear. The buttons are a little mushy, but still produce a definite click when pressed. The strap has plenty of holes allowing for granular adjustment and is made of a very flexible silicone. It is light and comfortable and features angled grooves on the outside, somewhat like jeans, for style. The grooves do pick up some extra dirt which makes it harder to keep clean. Finally, the charger is a bite style clasp that attaches to a few pins on the bottom of the watch. It also allows for a connection to a computer to upload files and update, but I never did that. The cable is extremely short, less than 2 feet, which makes it hard to put it in a nice place to charge. ",
            "<h4>Style</h4>",
            "As for style, the watch is square and has fairly large bezels. That bezel features white icons representing the primary functions of the buttons, while the buttons feature engravings describing their secondary functions, as well as a decent sized Garmin Logo. Overall it doesn't stand out, but it's definitely not a fashion piece.",
            "<h4>Screen</h4>",
            "The transflective display is easy to read from most viewing angles in a well lit scene. In darker situations, there is a backlight that is activated when any button is pressed, including the dedicated backlight button. When the backlight is activated the screen is easy to read in the dark or light, but when viewed from a shallow angle the colors on the screen appear to invert. Luckily because this is a black and white display it is still relatively easy to read when inverted. An interesting artifact of this reflective display is when a shaddow is cast across the screen part of it can remain visible while the rest is not. I've seen the screen described as \"high resolution\" but it is only 128 square pixels. This is plenty for the Garmin's simple interface, but I would still stray from calling it \"high resolution\".",
            "<h3>Interface</h3>",
            "<h4>Navigation</h4>",
            "The interface was fine for what it was working with. Most features were accessible by only one or two button clicks, but in general there weren't many features. Starting an run only took two clicks, viewing your heart rate one, and dismissing a new notification one.  All navigation is done with 3 of the 4 buttons representing select/start, down/next, and back. There is no up navigation button which can make it a bit clumsy to navigate through menus, but it's not a big deal. ",
            "<h4>Home Screen</h4>",
            "The home screen prominently features the time in the middle of the screen, with the date below, and status indicators for Bluetooth connection, battery, and alarm status above. This is exactly what I would want from the home screen. There is also an option for an analog clock, but it's small, hard to read, and doesn't feature the status indicators. When sitting at the home screen you can cycle between a few screens (Garmin calls them widgets) most of which aren't particularly useful. Luckily, all of them but time and steps can be disabled, but not reordered. I do keep heart rate and notifications enabled as they can be useful. But, Calories, intensity minutes, last activity, and weather are disabled on my watch. Most of these screens can be selected to show more detail or history.",
            "<h4>In Activity</h4>",
            "While running, the screen shows from top to bottom, distance, time, and live pace with an additional screen showing heart rate zone, heart rate, and calories, and a final screen showing the home screen. These screens can be customized to reorganize the fields and add lap time, lap distance, lap pace, average page, and cadence fields but additional screens cannot be added.",
            "<h3>GPS</h3>",
            "As mentioned in the introduction, I primary bought this running watch, to run. I would describe myself as a casual runner, running for fun and general fitness, plus occasional bike rides. My runs stay between 3 and 7 miles at roughly 7:30 pace. I found the GPS to connect faster than the Fossil Sport I tried before, but slower than my phone. I normally waited less than 30 seconds for it to connect. When mapping my runs, they appear more clean and accurate than my phone even was. Now, it could be that it pings less frequently and there isn't as much room for small errors. But, the location does still seem more accurate than I have experienced before.",
            "<h3>Battery</h3>",
            "I have been thoroughly impressed by the battery life of this watch. It advertises up to 9 days as a smartwatch and 13 hours while using the GPS, and I can confirm this. To be clear, I haven't measured the battery life, but this is mostly because I haven't needed to. There have been several days where I've woken up and thought \"I will probably need to give my watch a charge by tomorrow\", then had it last 2 more days. The battery remaining is denoted by 4 bars and it seems to spend the most time with 2 remaining. Now, I try to only charge my devices during the day in order to limit time on the charger and preserve their batteries. I generally take it off the charger when I notice it has reached 4 bars and plug it in when it reaches one. So I don't actually know for sure what happens when you pass those values. But it never seems to spend much time before dropping down to 3 bars and definitely takes more time for it to fall from 2 bars to 1 than 3 to 2. I have never had it fall below 1. As stated before, I haven't measured the battery life but I seem to end up charging it for less than an hour, every week or so.",
            "<h3>Smart Features</h3>",
            "<h4>Notifications</h4>",
            "Coming from Android Wear watches, I was a little disappointed with the smart features. The watch does offer notification support with a Bluetooth connection to your smartphone, but it is buried in the settings to enable it for more than a few apps they select by default. This lead to some frustration with the feature when I first got the watch (this setting can be found in the Garmin Connect settings (note: not the watch settings) > Smart Notifications). It is nice to have this feature to prevent specified apps from buzzing your wrist. Speaking of buzzes, notifications can be controlled for both in an activity and not with settings for silent, vibrate, tone, or vibrate and tone. Personally, I keep it on vibrate, but silent when in an activity. For the most part these buzzes come in at the instant they appear on the phone, but occasionally they will take a couple extra seconds. When a notification appears you have the option to ignore it or dismiss it. Some apps also show their extra \"action buttons\" as options (such as \"Mark as read\" or \"Delete\"), but I saw inconsistent support for this. My best guess is it's done differently in newer versions of Android than when the watch came out in 2016, but I have no way of knowing for sure. In general, notification support definitely gets the job done, but doesn't do anything extra.",
            "<h4>Music Control</h4>",
            "The other major smart feature is music controls, which leaves a lot to be desired. By holding the bottom right button the music control screen can be accessed. It allows playing and pausing the current track, as well as, skipping forward and backwards through tracks. That's it. I honestly don't know why they even bothered adding this feature. It doesn't even show you what is currently playing, which was one of my favorite things about Android Wear. Plus, no control of volume leaves it as one of my least used features.",
            "<h4>Weather</h4>",
            "Finally, it offers a weather widget, which is okay. It gives current temperature, high/low, precipitation chance, and current weather status (sunny, cloudy, rainy, etc.). Plus, pressing start gives a four hour outlook, but all of this is irrelevant because the widget rarely updates and I've seen it as far as 12 hours behind before. I have disabled this widget.",
            "<h4>Alarms</h4>",
            "This is a watch after all and it will let you set any number of repeating or one time alarms. They can be used to wake you up and snoozed if you want to stay in bed. The alarm isn't particularly loud, but it does buzz your wrist which is effective.",
            "<h4>Find My Phone</h4>",
            "Choosing \"Find My Phone\" in the watch's settings will make an obnoxiously loud sound while flashing the camera flash on your phone so you can find it when it is connected with Bluetooth. Note that to stop it you must press back on the watch, it cannot be stopped with the phone. This can come in incredibly useful, but be careful with it in quiet environments.",
            "<h4>MOVE!</h4>",
            "Finally, like many smartwatches, this will yell at you when you've been sedentary for too long. It is more than a simple stand up altert. It requires walking around to wear off the warning and increases the number of steps needed to wear it off the longer you sit. I find this feature very annoying, but it keeps me conscious of how long I've been sitting down.",
            "<h3>Garmin Connect</h3>",
            "I don't use the Garmin Connect app very heavily, but it does allow for a good amount of customization of watch settings and syncing of workouts. I have it set to upload to Strava when the watch syncs and it often uploads there before Garmin Connect. I have had no issues with syncing, besides that it doesn't sync often enough. After almost all my workouts I open the app so that the sync starts right away."
        ]
    }
]