[
    {
        "title": "Projects",
        "date": "2020-09-25",
        "link": "https://github.com/mail929",
        "content": ["These are just a couple placeholder projects as I complete my website.",
            "Please view my GitHub profile if you'd like to see more of my work.",
            "Unfortunately due to the nature of the work, I cannot share what I work on at Motorola.",
            "But I can confirm that I do not make phones, and nobody at the company works on the \"RAZR\"."
        ]
    },
    {
        "title": "LiamRank",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/LiamRank",
        "content": ["LiamRank is a spiritual successor to the FRC scouting app I helped develop in high school, WildRank.",
            "This time the app is developed for the web with simple client apps written for offline use on various platforms."
        ]
    },
    {
        "title": "Finance v2",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/Finance-v2",
        "content": ["Once apon a time I made a command line finances application with Pandas and a CSV file.",
            "Then I added a web interface on top of it, it became very messy.",
            "Now I have Finance v2 which is an Express.js web app with a MariaDB server and user accounts."
        ]
    },
    {
        "title": "Personal Site",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/personal-site",
        "content": ["This website is a self-hosted project of mine.",
            "Its some pretty basic CSS and HTML plus a few lines of JavaScript."
        ]
    },
    {
        "title": "School Work",
        "date": "2020-09-25",
        "link": "https://github.com/mail929/MU-Archive",
        "content": ["I worked on all kinds of projects in college.",
            "This includes Java, Python, C, JavaScript, SQL, and more.",
            "View my archive to see a large portion of my class and job work from college."
        ]
    },
    {
        "title": "Homepage",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/homepage",
        "content": ["Simple webpage that displays the time, a list of folders containing links and 2 groups of RSS feeds."]
    },
    {
        "title": "OTD Calcs Web",
        "date": "2020-09-26",
        "link": "https://github.com/mail929/otd-calcs-web",
        "content": ["Simple static webpage that calculates the OTD (out the door) price for a car sale."]
    }
]